src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименованиеКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСчет</name>
    <type>
      <types>CatalogRef.РасчетныеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
    Объект.ПолноеНаименованиеКонтрагента = "ООО """ + Объект.Наименование + """";
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)

    // Определяем, физ лицо или юр лицо
    ФизЛицо = ЭтоФизЛицо(Объект.ТипКонтрагента);

    // Для физлиц КПП не нужен
    Если ФизЛицо Тогда
        Объект.КПП = "";
        Возврат;
    КонецЕсли;

    // Для юрлица — обрезаем ИНН до 10 символов
    Если СтрДлина(Объект.ИНН) > 10 Тогда
        Объект.ИНН = Лев(Объект.ИНН, 10);
    КонецЕсли;

    // Если ИНН пуст — КПП пуст
    Если НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
        Объект.КПП = "";
        Возврат;
    КонецЕсли;

    // Здесь вызываем как раньше — расчёт КПП по ИНН
    ПересчитатьКПППоИНН();

КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)

    ФизЛицо = ЭтоФизЛицо(Объект.ТипКонтрагента);

    Если ФизЛицо Тогда
        
        Объект.КПП = "";
        Элементы.КПП.Доступность = Ложь;
        Элементы.КПП.Подсказка = "Для физических лиц КПП не заполняется";

    Иначе
        
        Элементы.КПП.Доступность = Истина;
        Элементы.КПП.Подсказка = "";

        Если ЗначениеЗаполнено(Объект.ИНН) Тогда
            ПересчитатьКПППоИНН();
        КонецЕсли;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКПППоИНН()

    ЗначениеИНН = Объект.ИНН;
    ДлинаИНН = СтрДлина(ЗначениеИНН);

    Если ДлинаИНН = 10 Тогда
        // Юридическое лицо
        Объект.КПП = Лев(ЗначениеИНН, 4) + "01001";
        
    ИначеЕсли ДлинаИНН = 12 Тогда
        // ИП
        Объект.КПП = "";
        
    Иначе
        Объект.КПП = "";
        Если ДлинаИНН > 0 Тогда
            Сообщить("Введен некорректный ИНН. ИНН должен состоять из 10 или 12 цифр.");
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры



&НаСервере
Функция ЭтоФизЛицо(ТипКонтрагента)
    Возврат ТипКонтрагента = Перечисления.ТипыКонтрагентов.ФизическоеЛицо;
КонецФункции
